
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	//ДЗ Нетология Автор = ТомиловаО.Н., Комментарий = "13.7", Дата = 2023-08-09{
	//Исходный код
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	//Изменненный код
	ТекущиеДанные.Сумма = СуммаПоСтроке(ТекущиеДанные);
	//ДЗ Нетология Автор = ТомиловаО.Н., Комментарий = "13.7", Дата = 2023-08-09
КонецПроцедуры


&НаКлиенте
Функция СуммаПоСтроке(Строка) 
//ДЗ Нетология Автор = ТомиловаО.Н., Комментарий = "13.7", Дата = 2023-08-09{
	КоэффициентСкидки = 1 - (Строка.Скидка + Объект.Sale_СогласованнаяСкидка) / 100; 
	Если КоэффициентСкидки >= 0 Тогда 
		Возврат Строка.Цена * Строка.Количество * КоэффициентСкидки; 
	Иначе 
		Возврат 0;
	КонецЕсли;
//ДЗ Нетология Автор = ТомиловаО.Н., Комментарий = "13.7", Дата = 2023-08-09
КонецФункции

&НаКлиенте
Асинх Процедура ЗадатьВопросПользователю()
//ДЗ Нетология Автор = ТомиловаО.Н., Комментарий = "13.7", Дата = 2023-08-09{
	РезультатВопроса = Ждать ВопросАсинх("Значение скидки изменилось. Пересчитать сумму в табличной части?", РежимДиалогаВопрос.ДаНет); 
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПересчитатьСуммуСУчетомСкидкиПродолжение(); 
	Иначе Возврат;
	КонецЕсли;
//ДЗ Нетология Автор = ТомиловаО.Н., Комментарий = "13.7", Дата = 2023-08-09
КонецПроцедуры
&НаКлиенте
Процедура ПересчитатьСуммуСУчетомСкидки()
//ДЗ Нетология Автор = ТомиловаО.Н., Комментарий = "13.7", Дата = 2023-08-09{
	Если Объект.Товары.Количество() > 0 Или Объект.Услуги.Количество() > 0 Тогда
		ЗадатьВопросПользователю();
	КонецЕсли;
//ДЗ Нетология Автор = ТомиловаО.Н., Комментарий = "13.7", Дата = 2023-08-09
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуСУчетомСкидкиПродолжение()
//ДЗ Нетология Автор = ТомиловаО.Н., Комментарий = "13.7", Дата = 2023-08-09{
	Для Каждого Товары Из Объект.Товары Цикл 
		Товары.Сумма = СуммаПоСтроке(Товары);
	КонецЦикла;
	Для Каждого Услуги Из Объект.Услуги Цикл
		Услуги.Сумма = СуммаПоСтроке(Услуги);
	КонецЦикла;
//ДЗ Нетология Автор = ТомиловаО.Н., Комментарий = "13.7", Дата = 2023-08-09
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
